## Plan Result (sbox_shutter_webapp - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;plumclassic&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["plumclassic"] must be replaced
-/+ resource "azurerm_dns_txt_record" "zone_validate" {
      ~ fqdn                = "_dnsauth.sandbox.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth" -> (known after apply)
      ~ name                = "_dnsauth" -> "_dnsauth.plumclassic" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["plumclassic"] must be replaced
-/+ resource "azurerm_static_site_custom_domain" "custom_domain" {
      ~ domain_name      = "sandbox.platform.hmcts.net" -> "plumclassic.sandbox.platform.hmcts.net" # forces replacement
      ~ id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/plumclassic/customDomains/sandbox.platform.hmcts.net" -> (known after apply)
      + validation_token = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        {
            backend_domain   = [
                "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com",
                "lb-sbox-int-plum.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "plum.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "plum"
            product          = "plum"
            shutter_app      = true
        },
      ~ {
          ~ custom_domain    = "sandbox.platform.hmcts.net" -> "plumclassic.sandbox.platform.hmcts.net"
            name             = "plumclassic"
            # (7 unchanged attributes hidden)
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2449,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp - TerraformPlanApply","Vars":{}} -->